const table = (props) => {
  
  const headerValue = [
    ['Веб-сайт', 'Веб-сайт'],
    ['Ответили', 'Отв.'],
    ['Ответили', 'Отв.'],
    ['Офис', 'Оф.'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Перевозка по Китаю', 'Пер. по КНР'],
    ['Переупаковка', 'Пер.'],
    ['Переупаковка', 'Пер.'],
    ['Переупаковка', 'Пер.'],
    ['Переупаковка', 'Пер.'],
    ['=дней', '=дн'],
    ['=цена', '=цена'],
  ];

  const data = [
    ['1 ktk - logistocs.com',	'2',	'ч.', 'МСК',	'Пкн',	'Мск',	'Авто',	'1',	'22',	'100',	'1000',	'$', 'М + с', '≈634',	'$'],
    ['2 ktk - logistocs.com', '2', 'ч.', 'МСК', 'Пкн', 'Мск', 'Авто', '1', '22', '100', '1000', '$', 'М + с', '≈634', '$'],
    ['3 ktk - logistocs.com', '2', 'ч.', 'МСК', 'Пкн', 'Мск', 'Авто', '1', '22', '100', '1000', '$', 'М + с', '≈634', '$'],
    ['4 ktk - logistocs.com', '2', 'ч.', 'МСК', 'Пкн', 'Мск', 'Авто', '1', '22', '100', '1000', '$', 'М + с', '≈634', '$']
  ]
  


  const columns = headerValue.map((column, index) => {
    console.log(column[index]);
    
      return { id: ( 'columns' + index),
               Header: column[1],
               accessor: data[1][index] }
    }
  );

  console.log(columns);
  




  return (
    <div className="table">
      
    </div>
  );
};